Microchip-MPLAB-Harmony/usb/apps/host/hid_basic_keyboard/firmware/src/packs/ATSAMA5D27_DFP/component/uhp_ehci.h
/**
 * \brief Component description for UHP_EHCI
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-01-10T17:30:45Z */
#ifndef _DA78_UHP_EHCI_COMPONENT_H_
#define _DA78_UHP_EHCI_COMPONENT_H_
#define _DA78_UHP_EHCI_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup PIC32CZ_DA78 USB Host High Speed Port
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR UHP_EHCI */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define UHP_EHCI_6354                       /**< (UHP_EHCI) Module ID */
#define REV_UHP_EHCI R                      /**< (UHP_EHCI) Module revision */

/* -------- UHP_EHCI_HCCAPBASE : (UHP_EHCI Offset: 0x00) (R/ 32) UHP_EHCI Host Controller Capability Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CAPLENGTH:8;               /**< bit:   0..7  Capability Registers Length              */
    uint32_t :8;                        /**< bit:  8..15  Reserved */
    uint32_t HCIVERSION:16;             /**< bit: 16..31  Host Controller Interface Version Number */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_HCCAPBASE_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_HCCAPBASE_OFFSET           (0x00)                                        /**<  (UHP_EHCI_HCCAPBASE) UHP_EHCI Host Controller Capability Register  Offset */

#define UHP_EHCI_HCCAPBASE_CAPLENGTH_Pos    0                                              /**< (UHP_EHCI_HCCAPBASE) Capability Registers Length Position */
#define UHP_EHCI_HCCAPBASE_CAPLENGTH_Msk    (_U_(0xFF) << UHP_EHCI_HCCAPBASE_CAPLENGTH_Pos)  /**< (UHP_EHCI_HCCAPBASE) Capability Registers Length Mask */
#define UHP_EHCI_HCCAPBASE_CAPLENGTH(value) (UHP_EHCI_HCCAPBASE_CAPLENGTH_Msk & ((value) << UHP_EHCI_HCCAPBASE_CAPLENGTH_Pos))
#define UHP_EHCI_HCCAPBASE_HCIVERSION_Pos   16                                             /**< (UHP_EHCI_HCCAPBASE) Host Controller Interface Version Number Position */
#define UHP_EHCI_HCCAPBASE_HCIVERSION_Msk   (_U_(0xFFFF) << UHP_EHCI_HCCAPBASE_HCIVERSION_Pos)  /**< (UHP_EHCI_HCCAPBASE) Host Controller Interface Version Number Mask */
#define UHP_EHCI_HCCAPBASE_HCIVERSION(value) (UHP_EHCI_HCCAPBASE_HCIVERSION_Msk & ((value) << UHP_EHCI_HCCAPBASE_HCIVERSION_Pos))
#define UHP_EHCI_HCCAPBASE_MASK             _U_(0xFFFF00FF)                                /**< \deprecated (UHP_EHCI_HCCAPBASE) Register MASK  (Use UHP_EHCI_HCCAPBASE_Msk instead)  */
#define UHP_EHCI_HCCAPBASE_Msk              _U_(0xFFFF00FF)                                /**< (UHP_EHCI_HCCAPBASE) Register Mask  */


/* -------- UHP_EHCI_HCSPARAMS : (UHP_EHCI Offset: 0x04) (R/ 32) UHP_EHCI Host Controller Structural Parameters Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t N_PORTS:4;                 /**< bit:   0..3  Number of Ports                          */
    uint32_t PPC:1;                     /**< bit:      4  Port Power Control                       */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t N_PCC:4;                   /**< bit:  8..11  Number of Ports per Companion Controller */
    uint32_t N_CC:4;                    /**< bit: 12..15  Number of Companion Controllers          */
    uint32_t P_INDICATOR:1;             /**< bit:     16  Port Indicators                          */
    uint32_t :3;                        /**< bit: 17..19  Reserved */
    uint32_t N_DP:4;                    /**< bit: 20..23  Debug Port Number                        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_HCSPARAMS_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_HCSPARAMS_OFFSET           (0x04)                                        /**<  (UHP_EHCI_HCSPARAMS) UHP_EHCI Host Controller Structural Parameters Register  Offset */

#define UHP_EHCI_HCSPARAMS_N_PORTS_Pos      0                                              /**< (UHP_EHCI_HCSPARAMS) Number of Ports Position */
#define UHP_EHCI_HCSPARAMS_N_PORTS_Msk      (_U_(0xF) << UHP_EHCI_HCSPARAMS_N_PORTS_Pos)   /**< (UHP_EHCI_HCSPARAMS) Number of Ports Mask */
#define UHP_EHCI_HCSPARAMS_N_PORTS(value)   (UHP_EHCI_HCSPARAMS_N_PORTS_Msk & ((value) << UHP_EHCI_HCSPARAMS_N_PORTS_Pos))
#define UHP_EHCI_HCSPARAMS_PPC_Pos          4                                              /**< (UHP_EHCI_HCSPARAMS) Port Power Control Position */
#define UHP_EHCI_HCSPARAMS_PPC_Msk          (_U_(0x1) << UHP_EHCI_HCSPARAMS_PPC_Pos)       /**< (UHP_EHCI_HCSPARAMS) Port Power Control Mask */
#define UHP_EHCI_HCSPARAMS_PPC              UHP_EHCI_HCSPARAMS_PPC_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_HCSPARAMS_PPC_Msk instead */
#define UHP_EHCI_HCSPARAMS_N_PCC_Pos        8                                              /**< (UHP_EHCI_HCSPARAMS) Number of Ports per Companion Controller Position */
#define UHP_EHCI_HCSPARAMS_N_PCC_Msk        (_U_(0xF) << UHP_EHCI_HCSPARAMS_N_PCC_Pos)     /**< (UHP_EHCI_HCSPARAMS) Number of Ports per Companion Controller Mask */
#define UHP_EHCI_HCSPARAMS_N_PCC(value)     (UHP_EHCI_HCSPARAMS_N_PCC_Msk & ((value) << UHP_EHCI_HCSPARAMS_N_PCC_Pos))
#define UHP_EHCI_HCSPARAMS_N_CC_Pos         12                                             /**< (UHP_EHCI_HCSPARAMS) Number of Companion Controllers Position */
#define UHP_EHCI_HCSPARAMS_N_CC_Msk         (_U_(0xF) << UHP_EHCI_HCSPARAMS_N_CC_Pos)      /**< (UHP_EHCI_HCSPARAMS) Number of Companion Controllers Mask */
#define UHP_EHCI_HCSPARAMS_N_CC(value)      (UHP_EHCI_HCSPARAMS_N_CC_Msk & ((value) << UHP_EHCI_HCSPARAMS_N_CC_Pos))
#define UHP_EHCI_HCSPARAMS_P_INDICATOR_Pos  16                                             /**< (UHP_EHCI_HCSPARAMS) Port Indicators Position */
#define UHP_EHCI_HCSPARAMS_P_INDICATOR_Msk  (_U_(0x1) << UHP_EHCI_HCSPARAMS_P_INDICATOR_Pos)  /**< (UHP_EHCI_HCSPARAMS) Port Indicators Mask */
#define UHP_EHCI_HCSPARAMS_P_INDICATOR      UHP_EHCI_HCSPARAMS_P_INDICATOR_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_HCSPARAMS_P_INDICATOR_Msk instead */
#define UHP_EHCI_HCSPARAMS_N_DP_Pos         20                                             /**< (UHP_EHCI_HCSPARAMS) Debug Port Number Position */
#define UHP_EHCI_HCSPARAMS_N_DP_Msk         (_U_(0xF) << UHP_EHCI_HCSPARAMS_N_DP_Pos)      /**< (UHP_EHCI_HCSPARAMS) Debug Port Number Mask */
#define UHP_EHCI_HCSPARAMS_N_DP(value)      (UHP_EHCI_HCSPARAMS_N_DP_Msk & ((value) << UHP_EHCI_HCSPARAMS_N_DP_Pos))
#define UHP_EHCI_HCSPARAMS_MASK             _U_(0xF1FF1F)                                  /**< \deprecated (UHP_EHCI_HCSPARAMS) Register MASK  (Use UHP_EHCI_HCSPARAMS_Msk instead)  */
#define UHP_EHCI_HCSPARAMS_Msk              _U_(0xF1FF1F)                                  /**< (UHP_EHCI_HCSPARAMS) Register Mask  */


/* -------- UHP_EHCI_HCCPARAMS : (UHP_EHCI Offset: 0x08) (R/ 32) UHP_EHCI Host Controller Capability Parameters Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t AC:1;                      /**< bit:      0  64-bit Addressing Capability             */
    uint32_t PFLF:1;                    /**< bit:      1  Programmable Frame List Flag             */
    uint32_t ASPC:1;                    /**< bit:      2  Asynchronous Schedule Park Capability    */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t IST:4;                     /**< bit:   4..7  Isochronous Scheduling Threshold         */
    uint32_t EECP:8;                    /**< bit:  8..15  EHCI Extended Capabilities Pointer       */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_HCCPARAMS_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_HCCPARAMS_OFFSET           (0x08)                                        /**<  (UHP_EHCI_HCCPARAMS) UHP_EHCI Host Controller Capability Parameters Register  Offset */

#define UHP_EHCI_HCCPARAMS_AC_Pos           0                                              /**< (UHP_EHCI_HCCPARAMS) 64-bit Addressing Capability Position */
#define UHP_EHCI_HCCPARAMS_AC_Msk           (_U_(0x1) << UHP_EHCI_HCCPARAMS_AC_Pos)        /**< (UHP_EHCI_HCCPARAMS) 64-bit Addressing Capability Mask */
#define UHP_EHCI_HCCPARAMS_AC               UHP_EHCI_HCCPARAMS_AC_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_HCCPARAMS_AC_Msk instead */
#define UHP_EHCI_HCCPARAMS_PFLF_Pos         1                                              /**< (UHP_EHCI_HCCPARAMS) Programmable Frame List Flag Position */
#define UHP_EHCI_HCCPARAMS_PFLF_Msk         (_U_(0x1) << UHP_EHCI_HCCPARAMS_PFLF_Pos)      /**< (UHP_EHCI_HCCPARAMS) Programmable Frame List Flag Mask */
#define UHP_EHCI_HCCPARAMS_PFLF             UHP_EHCI_HCCPARAMS_PFLF_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_HCCPARAMS_PFLF_Msk instead */
#define UHP_EHCI_HCCPARAMS_ASPC_Pos         2                                              /**< (UHP_EHCI_HCCPARAMS) Asynchronous Schedule Park Capability Position */
#define UHP_EHCI_HCCPARAMS_ASPC_Msk         (_U_(0x1) << UHP_EHCI_HCCPARAMS_ASPC_Pos)      /**< (UHP_EHCI_HCCPARAMS) Asynchronous Schedule Park Capability Mask */
#define UHP_EHCI_HCCPARAMS_ASPC             UHP_EHCI_HCCPARAMS_ASPC_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_HCCPARAMS_ASPC_Msk instead */
#define UHP_EHCI_HCCPARAMS_IST_Pos          4                                              /**< (UHP_EHCI_HCCPARAMS) Isochronous Scheduling Threshold Position */
#define UHP_EHCI_HCCPARAMS_IST_Msk          (_U_(0xF) << UHP_EHCI_HCCPARAMS_IST_Pos)       /**< (UHP_EHCI_HCCPARAMS) Isochronous Scheduling Threshold Mask */
#define UHP_EHCI_HCCPARAMS_IST(value)       (UHP_EHCI_HCCPARAMS_IST_Msk & ((value) << UHP_EHCI_HCCPARAMS_IST_Pos))
#define UHP_EHCI_HCCPARAMS_EECP_Pos         8                                              /**< (UHP_EHCI_HCCPARAMS) EHCI Extended Capabilities Pointer Position */
#define UHP_EHCI_HCCPARAMS_EECP_Msk         (_U_(0xFF) << UHP_EHCI_HCCPARAMS_EECP_Pos)     /**< (UHP_EHCI_HCCPARAMS) EHCI Extended Capabilities Pointer Mask */
#define UHP_EHCI_HCCPARAMS_EECP(value)      (UHP_EHCI_HCCPARAMS_EECP_Msk & ((value) << UHP_EHCI_HCCPARAMS_EECP_Pos))
#define UHP_EHCI_HCCPARAMS_MASK             _U_(0xFFF7)                                    /**< \deprecated (UHP_EHCI_HCCPARAMS) Register MASK  (Use UHP_EHCI_HCCPARAMS_Msk instead)  */
#define UHP_EHCI_HCCPARAMS_Msk              _U_(0xFFF7)                                    /**< (UHP_EHCI_HCCPARAMS) Register Mask  */


