Microchip-MPLAB-Harmony/usb/apps/host/hid_basic_keyboard/firmware/src/packs/ATSAMA5D27_DFP/component/uhp_ehci.h
/* -------- UHP_EHCI_USBCMD : (UHP_EHCI Offset: 0x10) (R/W 32) UHP_EHCI USB Command Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RS:1;                      /**< bit:      0  Run/Stop (read/write)                    */
    uint32_t HCRESET:1;                 /**< bit:      1  Host Controller Reset (read/write)       */
    uint32_t FLS:2;                     /**< bit:   2..3  Frame List Size (read/write or read-only) */
    uint32_t PSE:1;                     /**< bit:      4  Periodic Schedule Enable (read/write)    */
    uint32_t ASE:1;                     /**< bit:      5  Asynchronous Schedule Enable (read/write) */
    uint32_t IAAD:1;                    /**< bit:      6  Interrupt on Async Advance Doorbell (read/write) */
    uint32_t LHCR:1;                    /**< bit:      7  Light Host Controller Reset (optional) (read/write) */
    uint32_t ASPMC:2;                   /**< bit:   8..9  Asynchronous Schedule Park Mode Count (optional) (read/write or read-only) */
    uint32_t :1;                        /**< bit:     10  Reserved */
    uint32_t ASPME:1;                   /**< bit:     11  Asynchronous Schedule Park Mode Enable (optional) (read/write or read-only) */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t ITC:8;                     /**< bit: 16..23  Interrupt Threshold Control (read/write) */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_USBCMD_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_USBCMD_OFFSET              (0x10)                                        /**<  (UHP_EHCI_USBCMD) UHP_EHCI USB Command Register  Offset */

#define UHP_EHCI_USBCMD_RS_Pos              0                                              /**< (UHP_EHCI_USBCMD) Run/Stop (read/write) Position */
#define UHP_EHCI_USBCMD_RS_Msk              (_U_(0x1) << UHP_EHCI_USBCMD_RS_Pos)           /**< (UHP_EHCI_USBCMD) Run/Stop (read/write) Mask */
#define UHP_EHCI_USBCMD_RS                  UHP_EHCI_USBCMD_RS_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_RS_Msk instead */
#define UHP_EHCI_USBCMD_HCRESET_Pos         1                                              /**< (UHP_EHCI_USBCMD) Host Controller Reset (read/write) Position */
#define UHP_EHCI_USBCMD_HCRESET_Msk         (_U_(0x1) << UHP_EHCI_USBCMD_HCRESET_Pos)      /**< (UHP_EHCI_USBCMD) Host Controller Reset (read/write) Mask */
#define UHP_EHCI_USBCMD_HCRESET             UHP_EHCI_USBCMD_HCRESET_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_HCRESET_Msk instead */
#define UHP_EHCI_USBCMD_FLS_Pos             2                                              /**< (UHP_EHCI_USBCMD) Frame List Size (read/write or read-only) Position */
#define UHP_EHCI_USBCMD_FLS_Msk             (_U_(0x3) << UHP_EHCI_USBCMD_FLS_Pos)          /**< (UHP_EHCI_USBCMD) Frame List Size (read/write or read-only) Mask */
#define UHP_EHCI_USBCMD_FLS(value)          (UHP_EHCI_USBCMD_FLS_Msk & ((value) << UHP_EHCI_USBCMD_FLS_Pos))
#define UHP_EHCI_USBCMD_PSE_Pos             4                                              /**< (UHP_EHCI_USBCMD) Periodic Schedule Enable (read/write) Position */
#define UHP_EHCI_USBCMD_PSE_Msk             (_U_(0x1) << UHP_EHCI_USBCMD_PSE_Pos)          /**< (UHP_EHCI_USBCMD) Periodic Schedule Enable (read/write) Mask */
#define UHP_EHCI_USBCMD_PSE                 UHP_EHCI_USBCMD_PSE_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_PSE_Msk instead */
#define UHP_EHCI_USBCMD_ASE_Pos             5                                              /**< (UHP_EHCI_USBCMD) Asynchronous Schedule Enable (read/write) Position */
#define UHP_EHCI_USBCMD_ASE_Msk             (_U_(0x1) << UHP_EHCI_USBCMD_ASE_Pos)          /**< (UHP_EHCI_USBCMD) Asynchronous Schedule Enable (read/write) Mask */
#define UHP_EHCI_USBCMD_ASE                 UHP_EHCI_USBCMD_ASE_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_ASE_Msk instead */
#define UHP_EHCI_USBCMD_IAAD_Pos            6                                              /**< (UHP_EHCI_USBCMD) Interrupt on Async Advance Doorbell (read/write) Position */
#define UHP_EHCI_USBCMD_IAAD_Msk            (_U_(0x1) << UHP_EHCI_USBCMD_IAAD_Pos)         /**< (UHP_EHCI_USBCMD) Interrupt on Async Advance Doorbell (read/write) Mask */
#define UHP_EHCI_USBCMD_IAAD                UHP_EHCI_USBCMD_IAAD_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_IAAD_Msk instead */
#define UHP_EHCI_USBCMD_LHCR_Pos            7                                              /**< (UHP_EHCI_USBCMD) Light Host Controller Reset (optional) (read/write) Position */
#define UHP_EHCI_USBCMD_LHCR_Msk            (_U_(0x1) << UHP_EHCI_USBCMD_LHCR_Pos)         /**< (UHP_EHCI_USBCMD) Light Host Controller Reset (optional) (read/write) Mask */
#define UHP_EHCI_USBCMD_LHCR                UHP_EHCI_USBCMD_LHCR_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_LHCR_Msk instead */
#define UHP_EHCI_USBCMD_ASPMC_Pos           8                                              /**< (UHP_EHCI_USBCMD) Asynchronous Schedule Park Mode Count (optional) (read/write or read-only) Position */
#define UHP_EHCI_USBCMD_ASPMC_Msk           (_U_(0x3) << UHP_EHCI_USBCMD_ASPMC_Pos)        /**< (UHP_EHCI_USBCMD) Asynchronous Schedule Park Mode Count (optional) (read/write or read-only) Mask */
#define UHP_EHCI_USBCMD_ASPMC(value)        (UHP_EHCI_USBCMD_ASPMC_Msk & ((value) << UHP_EHCI_USBCMD_ASPMC_Pos))
#define UHP_EHCI_USBCMD_ASPME_Pos           11                                             /**< (UHP_EHCI_USBCMD) Asynchronous Schedule Park Mode Enable (optional) (read/write or read-only) Position */
#define UHP_EHCI_USBCMD_ASPME_Msk           (_U_(0x1) << UHP_EHCI_USBCMD_ASPME_Pos)        /**< (UHP_EHCI_USBCMD) Asynchronous Schedule Park Mode Enable (optional) (read/write or read-only) Mask */
#define UHP_EHCI_USBCMD_ASPME               UHP_EHCI_USBCMD_ASPME_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBCMD_ASPME_Msk instead */
#define UHP_EHCI_USBCMD_ITC_Pos             16                                             /**< (UHP_EHCI_USBCMD) Interrupt Threshold Control (read/write) Position */
#define UHP_EHCI_USBCMD_ITC_Msk             (_U_(0xFF) << UHP_EHCI_USBCMD_ITC_Pos)         /**< (UHP_EHCI_USBCMD) Interrupt Threshold Control (read/write) Mask */
#define UHP_EHCI_USBCMD_ITC(value)          (UHP_EHCI_USBCMD_ITC_Msk & ((value) << UHP_EHCI_USBCMD_ITC_Pos))
#define UHP_EHCI_USBCMD_MASK                _U_(0xFF0BFF)                                  /**< \deprecated (UHP_EHCI_USBCMD) Register MASK  (Use UHP_EHCI_USBCMD_Msk instead)  */
#define UHP_EHCI_USBCMD_Msk                 _U_(0xFF0BFF)                                  /**< (UHP_EHCI_USBCMD) Register Mask  */


