Microchip-MPLAB-Harmony/usb/apps/host/hid_basic_keyboard/firmware/src/packs/ATSAMA5D27_DFP/component/uhp_ehci.h
/* -------- UHP_EHCI_USBSTS : (UHP_EHCI Offset: 0x14) (R/W 32) UHP_EHCI USB Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t USBINT:1;                  /**< bit:      0  USB Interrupt (read/write clear)         */
    uint32_t USBERRINT:1;               /**< bit:      1  USB Error Interrupt (read/write clear)   */
    uint32_t PCD:1;                     /**< bit:      2  Port Change Detect (read/write clear)    */
    uint32_t FLR:1;                     /**< bit:      3  Frame List Rollover (read/write clear)   */
    uint32_t HSE:1;                     /**< bit:      4  Host System Error (read/write clear)     */
    uint32_t IAA:1;                     /**< bit:      5  Interrupt on Async Advance (read/write clear) */
    uint32_t :6;                        /**< bit:  6..11  Reserved */
    uint32_t HCHLT:1;                   /**< bit:     12  HCHalted (read-only)                     */
    uint32_t RCM:1;                     /**< bit:     13  Reclamation (read-only)                  */
    uint32_t PSS:1;                     /**< bit:     14  Periodic Schedule Status (read-only)     */
    uint32_t ASS:1;                     /**< bit:     15  Asynchronous Schedule Status (read-only) */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_USBSTS_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_USBSTS_OFFSET              (0x14)                                        /**<  (UHP_EHCI_USBSTS) UHP_EHCI USB Status Register  Offset */

#define UHP_EHCI_USBSTS_USBINT_Pos          0                                              /**< (UHP_EHCI_USBSTS) USB Interrupt (read/write clear) Position */
#define UHP_EHCI_USBSTS_USBINT_Msk          (_U_(0x1) << UHP_EHCI_USBSTS_USBINT_Pos)       /**< (UHP_EHCI_USBSTS) USB Interrupt (read/write clear) Mask */
#define UHP_EHCI_USBSTS_USBINT              UHP_EHCI_USBSTS_USBINT_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_USBINT_Msk instead */
#define UHP_EHCI_USBSTS_USBERRINT_Pos       1                                              /**< (UHP_EHCI_USBSTS) USB Error Interrupt (read/write clear) Position */
#define UHP_EHCI_USBSTS_USBERRINT_Msk       (_U_(0x1) << UHP_EHCI_USBSTS_USBERRINT_Pos)    /**< (UHP_EHCI_USBSTS) USB Error Interrupt (read/write clear) Mask */
#define UHP_EHCI_USBSTS_USBERRINT           UHP_EHCI_USBSTS_USBERRINT_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_USBERRINT_Msk instead */
#define UHP_EHCI_USBSTS_PCD_Pos             2                                              /**< (UHP_EHCI_USBSTS) Port Change Detect (read/write clear) Position */
#define UHP_EHCI_USBSTS_PCD_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_PCD_Pos)          /**< (UHP_EHCI_USBSTS) Port Change Detect (read/write clear) Mask */
#define UHP_EHCI_USBSTS_PCD                 UHP_EHCI_USBSTS_PCD_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_PCD_Msk instead */
#define UHP_EHCI_USBSTS_FLR_Pos             3                                              /**< (UHP_EHCI_USBSTS) Frame List Rollover (read/write clear) Position */
#define UHP_EHCI_USBSTS_FLR_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_FLR_Pos)          /**< (UHP_EHCI_USBSTS) Frame List Rollover (read/write clear) Mask */
#define UHP_EHCI_USBSTS_FLR                 UHP_EHCI_USBSTS_FLR_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_FLR_Msk instead */
#define UHP_EHCI_USBSTS_HSE_Pos             4                                              /**< (UHP_EHCI_USBSTS) Host System Error (read/write clear) Position */
#define UHP_EHCI_USBSTS_HSE_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_HSE_Pos)          /**< (UHP_EHCI_USBSTS) Host System Error (read/write clear) Mask */
#define UHP_EHCI_USBSTS_HSE                 UHP_EHCI_USBSTS_HSE_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_HSE_Msk instead */
#define UHP_EHCI_USBSTS_IAA_Pos             5                                              /**< (UHP_EHCI_USBSTS) Interrupt on Async Advance (read/write clear) Position */
#define UHP_EHCI_USBSTS_IAA_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_IAA_Pos)          /**< (UHP_EHCI_USBSTS) Interrupt on Async Advance (read/write clear) Mask */
#define UHP_EHCI_USBSTS_IAA                 UHP_EHCI_USBSTS_IAA_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_IAA_Msk instead */
#define UHP_EHCI_USBSTS_HCHLT_Pos           12                                             /**< (UHP_EHCI_USBSTS) HCHalted (read-only) Position */
#define UHP_EHCI_USBSTS_HCHLT_Msk           (_U_(0x1) << UHP_EHCI_USBSTS_HCHLT_Pos)        /**< (UHP_EHCI_USBSTS) HCHalted (read-only) Mask */
#define UHP_EHCI_USBSTS_HCHLT               UHP_EHCI_USBSTS_HCHLT_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_HCHLT_Msk instead */
#define UHP_EHCI_USBSTS_RCM_Pos             13                                             /**< (UHP_EHCI_USBSTS) Reclamation (read-only) Position */
#define UHP_EHCI_USBSTS_RCM_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_RCM_Pos)          /**< (UHP_EHCI_USBSTS) Reclamation (read-only) Mask */
#define UHP_EHCI_USBSTS_RCM                 UHP_EHCI_USBSTS_RCM_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_RCM_Msk instead */
#define UHP_EHCI_USBSTS_PSS_Pos             14                                             /**< (UHP_EHCI_USBSTS) Periodic Schedule Status (read-only) Position */
#define UHP_EHCI_USBSTS_PSS_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_PSS_Pos)          /**< (UHP_EHCI_USBSTS) Periodic Schedule Status (read-only) Mask */
#define UHP_EHCI_USBSTS_PSS                 UHP_EHCI_USBSTS_PSS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_PSS_Msk instead */
#define UHP_EHCI_USBSTS_ASS_Pos             15                                             /**< (UHP_EHCI_USBSTS) Asynchronous Schedule Status (read-only) Position */
#define UHP_EHCI_USBSTS_ASS_Msk             (_U_(0x1) << UHP_EHCI_USBSTS_ASS_Pos)          /**< (UHP_EHCI_USBSTS) Asynchronous Schedule Status (read-only) Mask */
#define UHP_EHCI_USBSTS_ASS                 UHP_EHCI_USBSTS_ASS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBSTS_ASS_Msk instead */
#define UHP_EHCI_USBSTS_MASK                _U_(0xF03F)                                    /**< \deprecated (UHP_EHCI_USBSTS) Register MASK  (Use UHP_EHCI_USBSTS_Msk instead)  */
#define UHP_EHCI_USBSTS_Msk                 _U_(0xF03F)                                    /**< (UHP_EHCI_USBSTS) Register Mask  */


/* -------- UHP_EHCI_USBINTR : (UHP_EHCI Offset: 0x18) (R/W 32) UHP_EHCI USB Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t USBIE:1;                   /**< bit:      0  USB Interrupt Enable                     */
    uint32_t USBEIE:1;                  /**< bit:      1  USB Error Interrupt Enable               */
    uint32_t PCIE:1;                    /**< bit:      2  Port Change Interrupt Enable             */
    uint32_t FLRE:1;                    /**< bit:      3  Frame List Rollover Enable               */
    uint32_t HSEE:1;                    /**< bit:      4  Host System Error Enable                 */
    uint32_t IAAE:1;                    /**< bit:      5  Interrupt on Async Advance Enable        */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_USBINTR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

