Microchip-MPLAB-Harmony/usb/apps/host/hid_basic_keyboard/firmware/src/packs/ATSAMA5D27_DFP/component/uhp_ehci.h
#define UHP_EHCI_USBINTR_OFFSET             (0x18)                                        /**<  (UHP_EHCI_USBINTR) UHP_EHCI USB Interrupt Enable Register  Offset */

#define UHP_EHCI_USBINTR_USBIE_Pos          0                                              /**< (UHP_EHCI_USBINTR) USB Interrupt Enable Position */
#define UHP_EHCI_USBINTR_USBIE_Msk          (_U_(0x1) << UHP_EHCI_USBINTR_USBIE_Pos)       /**< (UHP_EHCI_USBINTR) USB Interrupt Enable Mask */
#define UHP_EHCI_USBINTR_USBIE              UHP_EHCI_USBINTR_USBIE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBINTR_USBIE_Msk instead */
#define UHP_EHCI_USBINTR_USBEIE_Pos         1                                              /**< (UHP_EHCI_USBINTR) USB Error Interrupt Enable Position */
#define UHP_EHCI_USBINTR_USBEIE_Msk         (_U_(0x1) << UHP_EHCI_USBINTR_USBEIE_Pos)      /**< (UHP_EHCI_USBINTR) USB Error Interrupt Enable Mask */
#define UHP_EHCI_USBINTR_USBEIE             UHP_EHCI_USBINTR_USBEIE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBINTR_USBEIE_Msk instead */
#define UHP_EHCI_USBINTR_PCIE_Pos           2                                              /**< (UHP_EHCI_USBINTR) Port Change Interrupt Enable Position */
#define UHP_EHCI_USBINTR_PCIE_Msk           (_U_(0x1) << UHP_EHCI_USBINTR_PCIE_Pos)        /**< (UHP_EHCI_USBINTR) Port Change Interrupt Enable Mask */
#define UHP_EHCI_USBINTR_PCIE               UHP_EHCI_USBINTR_PCIE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBINTR_PCIE_Msk instead */
#define UHP_EHCI_USBINTR_FLRE_Pos           3                                              /**< (UHP_EHCI_USBINTR) Frame List Rollover Enable Position */
#define UHP_EHCI_USBINTR_FLRE_Msk           (_U_(0x1) << UHP_EHCI_USBINTR_FLRE_Pos)        /**< (UHP_EHCI_USBINTR) Frame List Rollover Enable Mask */
#define UHP_EHCI_USBINTR_FLRE               UHP_EHCI_USBINTR_FLRE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBINTR_FLRE_Msk instead */
#define UHP_EHCI_USBINTR_HSEE_Pos           4                                              /**< (UHP_EHCI_USBINTR) Host System Error Enable Position */
#define UHP_EHCI_USBINTR_HSEE_Msk           (_U_(0x1) << UHP_EHCI_USBINTR_HSEE_Pos)        /**< (UHP_EHCI_USBINTR) Host System Error Enable Mask */
#define UHP_EHCI_USBINTR_HSEE               UHP_EHCI_USBINTR_HSEE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBINTR_HSEE_Msk instead */
#define UHP_EHCI_USBINTR_IAAE_Pos           5                                              /**< (UHP_EHCI_USBINTR) Interrupt on Async Advance Enable Position */
#define UHP_EHCI_USBINTR_IAAE_Msk           (_U_(0x1) << UHP_EHCI_USBINTR_IAAE_Pos)        /**< (UHP_EHCI_USBINTR) Interrupt on Async Advance Enable Mask */
#define UHP_EHCI_USBINTR_IAAE               UHP_EHCI_USBINTR_IAAE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_USBINTR_IAAE_Msk instead */
#define UHP_EHCI_USBINTR_MASK               _U_(0x3F)                                      /**< \deprecated (UHP_EHCI_USBINTR) Register MASK  (Use UHP_EHCI_USBINTR_Msk instead)  */
#define UHP_EHCI_USBINTR_Msk                _U_(0x3F)                                      /**< (UHP_EHCI_USBINTR) Register Mask  */


/* -------- UHP_EHCI_FRINDEX : (UHP_EHCI Offset: 0x1c) (R/W 32) UHP_EHCI USB Frame Index Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t FI:14;                     /**< bit:  0..13  Frame Index                              */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_FRINDEX_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_FRINDEX_OFFSET             (0x1C)                                        /**<  (UHP_EHCI_FRINDEX) UHP_EHCI USB Frame Index Register  Offset */

#define UHP_EHCI_FRINDEX_FI_Pos             0                                              /**< (UHP_EHCI_FRINDEX) Frame Index Position */
#define UHP_EHCI_FRINDEX_FI_Msk             (_U_(0x3FFF) << UHP_EHCI_FRINDEX_FI_Pos)       /**< (UHP_EHCI_FRINDEX) Frame Index Mask */
#define UHP_EHCI_FRINDEX_FI(value)          (UHP_EHCI_FRINDEX_FI_Msk & ((value) << UHP_EHCI_FRINDEX_FI_Pos))
#define UHP_EHCI_FRINDEX_MASK               _U_(0x3FFF)                                    /**< \deprecated (UHP_EHCI_FRINDEX) Register MASK  (Use UHP_EHCI_FRINDEX_Msk instead)  */
#define UHP_EHCI_FRINDEX_Msk                _U_(0x3FFF)                                    /**< (UHP_EHCI_FRINDEX) Register Mask  */


/* -------- UHP_EHCI_CTRLDSSEGMENT : (UHP_EHCI Offset: 0x20) (R/W 32) UHP_EHCI Control Data Structure Segment Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_CTRLDSSEGMENT_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_CTRLDSSEGMENT_OFFSET       (0x20)                                        /**<  (UHP_EHCI_CTRLDSSEGMENT) UHP_EHCI Control Data Structure Segment Register  Offset */

#define UHP_EHCI_CTRLDSSEGMENT_MASK         _U_(0x00)                                      /**< \deprecated (UHP_EHCI_CTRLDSSEGMENT) Register MASK  (Use UHP_EHCI_CTRLDSSEGMENT_Msk instead)  */
#define UHP_EHCI_CTRLDSSEGMENT_Msk          _U_(0x00)                                      /**< (UHP_EHCI_CTRLDSSEGMENT) Register Mask  */


/* -------- UHP_EHCI_PERIODICLISTBASE : (UHP_EHCI Offset: 0x24) (R/W 32) UHP_EHCI Periodic Frame List Base Address Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :12;                       /**< bit:  0..11  Reserved */
    uint32_t BA:20;                     /**< bit: 12..31  Base Address (Low)                       */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_PERIODICLISTBASE_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_PERIODICLISTBASE_OFFSET    (0x24)                                        /**<  (UHP_EHCI_PERIODICLISTBASE) UHP_EHCI Periodic Frame List Base Address Register  Offset */

#define UHP_EHCI_PERIODICLISTBASE_BA_Pos    12                                             /**< (UHP_EHCI_PERIODICLISTBASE) Base Address (Low) Position */
#define UHP_EHCI_PERIODICLISTBASE_BA_Msk    (_U_(0xFFFFF) << UHP_EHCI_PERIODICLISTBASE_BA_Pos)  /**< (UHP_EHCI_PERIODICLISTBASE) Base Address (Low) Mask */
#define UHP_EHCI_PERIODICLISTBASE_BA(value) (UHP_EHCI_PERIODICLISTBASE_BA_Msk & ((value) << UHP_EHCI_PERIODICLISTBASE_BA_Pos))
#define UHP_EHCI_PERIODICLISTBASE_MASK      _U_(0xFFFFF000)                                /**< \deprecated (UHP_EHCI_PERIODICLISTBASE) Register MASK  (Use UHP_EHCI_PERIODICLISTBASE_Msk instead)  */
#define UHP_EHCI_PERIODICLISTBASE_Msk       _U_(0xFFFFF000)                                /**< (UHP_EHCI_PERIODICLISTBASE) Register Mask  */


/* -------- UHP_EHCI_ASYNCLISTADDR : (UHP_EHCI Offset: 0x28) (R/W 32) UHP_EHCI Asynchronous List Address Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :5;                        /**< bit:   0..4  Reserved */
    uint32_t LPL:27;                    /**< bit:  5..31  Link Pointer Low                         */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_ASYNCLISTADDR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_ASYNCLISTADDR_OFFSET       (0x28)                                        /**<  (UHP_EHCI_ASYNCLISTADDR) UHP_EHCI Asynchronous List Address Register  Offset */

