Microchip-MPLAB-Harmony/usb/apps/host/hid_basic_keyboard/firmware/src/packs/ATSAMA5D27_DFP/component/uhp_ehci.h
#define UHP_EHCI_ASYNCLISTADDR_LPL_Pos      5                                              /**< (UHP_EHCI_ASYNCLISTADDR) Link Pointer Low Position */
#define UHP_EHCI_ASYNCLISTADDR_LPL_Msk      (_U_(0x7FFFFFF) << UHP_EHCI_ASYNCLISTADDR_LPL_Pos)  /**< (UHP_EHCI_ASYNCLISTADDR) Link Pointer Low Mask */
#define UHP_EHCI_ASYNCLISTADDR_LPL(value)   (UHP_EHCI_ASYNCLISTADDR_LPL_Msk & ((value) << UHP_EHCI_ASYNCLISTADDR_LPL_Pos))
#define UHP_EHCI_ASYNCLISTADDR_MASK         _U_(0xFFFFFFE0)                                /**< \deprecated (UHP_EHCI_ASYNCLISTADDR) Register MASK  (Use UHP_EHCI_ASYNCLISTADDR_Msk instead)  */
#define UHP_EHCI_ASYNCLISTADDR_Msk          _U_(0xFFFFFFE0)                                /**< (UHP_EHCI_ASYNCLISTADDR) Register Mask  */


/* -------- UHP_EHCI_CONFIGFLAG : (UHP_EHCI Offset: 0x50) (R/W 32) UHP_EHCI Configured Flag Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CF:1;                      /**< bit:      0  Configure Flag (read/write)              */
    uint32_t :31;                       /**< bit:  1..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_CONFIGFLAG_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_CONFIGFLAG_OFFSET          (0x50)                                        /**<  (UHP_EHCI_CONFIGFLAG) UHP_EHCI Configured Flag Register  Offset */

#define UHP_EHCI_CONFIGFLAG_CF_Pos          0                                              /**< (UHP_EHCI_CONFIGFLAG) Configure Flag (read/write) Position */
#define UHP_EHCI_CONFIGFLAG_CF_Msk          (_U_(0x1) << UHP_EHCI_CONFIGFLAG_CF_Pos)       /**< (UHP_EHCI_CONFIGFLAG) Configure Flag (read/write) Mask */
#define UHP_EHCI_CONFIGFLAG_CF              UHP_EHCI_CONFIGFLAG_CF_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_CONFIGFLAG_CF_Msk instead */
#define UHP_EHCI_CONFIGFLAG_MASK            _U_(0x01)                                      /**< \deprecated (UHP_EHCI_CONFIGFLAG) Register MASK  (Use UHP_EHCI_CONFIGFLAG_Msk instead)  */
#define UHP_EHCI_CONFIGFLAG_Msk             _U_(0x01)                                      /**< (UHP_EHCI_CONFIGFLAG) Register Mask  */


/* -------- UHP_EHCI_PORTSC : (UHP_EHCI Offset: 0x54) (R/W 32) UHP_EHCI Port Status and Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CCS:1;                     /**< bit:      0  Current Connect Status (read-only)       */
    uint32_t CSC:1;                     /**< bit:      1  Connect Status Change (read/write clear) */
    uint32_t PED:1;                     /**< bit:      2  Port Enabled/Disabled (read/write)       */
    uint32_t PEDC:1;                    /**< bit:      3  Port Enable/Disable Change (read/write clear) */
    uint32_t OCA:1;                     /**< bit:      4  Over-current Active (read-only)          */
    uint32_t OCC:1;                     /**< bit:      5  Over-current Change (read/write clear)   */
    uint32_t FPR:1;                     /**< bit:      6  Force Port Resume (read/write)           */
    uint32_t SUS:1;                     /**< bit:      7  Suspend (read/write)                     */
    uint32_t PR:1;                      /**< bit:      8  Port Reset (read/write)                  */
    uint32_t :1;                        /**< bit:      9  Reserved */
    uint32_t LS:2;                      /**< bit: 10..11  Line Status (read-only)                  */
    uint32_t PP:1;                      /**< bit:     12  Port Power (read/write or read-only)     */
    uint32_t PO:1;                      /**< bit:     13  Port Owner (read/write)                  */
    uint32_t PIC:2;                     /**< bit: 14..15  Port Indicator Control (read/write)      */
    uint32_t PTC:4;                     /**< bit: 16..19  Port Test Control (read/write)           */
    uint32_t WKCNNT_E:1;                /**< bit:     20  Wake on Connect Enable (read/write)      */
    uint32_t WKDSCNNT_E:1;              /**< bit:     21  Wake on Disconnect Enable (read/write)   */
    uint32_t WKOC_E:1;                  /**< bit:     22  Wake on Over-current Enable (read/write) */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_PORTSC_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UHP_EHCI_PORTSC_OFFSET              (0x54)                                        /**<  (UHP_EHCI_PORTSC) UHP_EHCI Port Status and Control Register  Offset */

#define UHP_EHCI_PORTSC_CCS_Pos             0                                              /**< (UHP_EHCI_PORTSC) Current Connect Status (read-only) Position */
#define UHP_EHCI_PORTSC_CCS_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_CCS_Pos)          /**< (UHP_EHCI_PORTSC) Current Connect Status (read-only) Mask */
#define UHP_EHCI_PORTSC_CCS                 UHP_EHCI_PORTSC_CCS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_CCS_Msk instead */
#define UHP_EHCI_PORTSC_CSC_Pos             1                                              /**< (UHP_EHCI_PORTSC) Connect Status Change (read/write clear) Position */
#define UHP_EHCI_PORTSC_CSC_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_CSC_Pos)          /**< (UHP_EHCI_PORTSC) Connect Status Change (read/write clear) Mask */
#define UHP_EHCI_PORTSC_CSC                 UHP_EHCI_PORTSC_CSC_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_CSC_Msk instead */
#define UHP_EHCI_PORTSC_PED_Pos             2                                              /**< (UHP_EHCI_PORTSC) Port Enabled/Disabled (read/write) Position */
#define UHP_EHCI_PORTSC_PED_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_PED_Pos)          /**< (UHP_EHCI_PORTSC) Port Enabled/Disabled (read/write) Mask */
#define UHP_EHCI_PORTSC_PED                 UHP_EHCI_PORTSC_PED_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_PED_Msk instead */
#define UHP_EHCI_PORTSC_PEDC_Pos            3                                              /**< (UHP_EHCI_PORTSC) Port Enable/Disable Change (read/write clear) Position */
#define UHP_EHCI_PORTSC_PEDC_Msk            (_U_(0x1) << UHP_EHCI_PORTSC_PEDC_Pos)         /**< (UHP_EHCI_PORTSC) Port Enable/Disable Change (read/write clear) Mask */
#define UHP_EHCI_PORTSC_PEDC                UHP_EHCI_PORTSC_PEDC_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_PEDC_Msk instead */
#define UHP_EHCI_PORTSC_OCA_Pos             4                                              /**< (UHP_EHCI_PORTSC) Over-current Active (read-only) Position */
#define UHP_EHCI_PORTSC_OCA_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_OCA_Pos)          /**< (UHP_EHCI_PORTSC) Over-current Active (read-only) Mask */
#define UHP_EHCI_PORTSC_OCA                 UHP_EHCI_PORTSC_OCA_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_OCA_Msk instead */
#define UHP_EHCI_PORTSC_OCC_Pos             5                                              /**< (UHP_EHCI_PORTSC) Over-current Change (read/write clear) Position */
#define UHP_EHCI_PORTSC_OCC_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_OCC_Pos)          /**< (UHP_EHCI_PORTSC) Over-current Change (read/write clear) Mask */
#define UHP_EHCI_PORTSC_OCC                 UHP_EHCI_PORTSC_OCC_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_OCC_Msk instead */
#define UHP_EHCI_PORTSC_FPR_Pos             6                                              /**< (UHP_EHCI_PORTSC) Force Port Resume (read/write) Position */
#define UHP_EHCI_PORTSC_FPR_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_FPR_Pos)          /**< (UHP_EHCI_PORTSC) Force Port Resume (read/write) Mask */
#define UHP_EHCI_PORTSC_FPR                 UHP_EHCI_PORTSC_FPR_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_FPR_Msk instead */
#define UHP_EHCI_PORTSC_SUS_Pos             7                                              /**< (UHP_EHCI_PORTSC) Suspend (read/write) Position */
#define UHP_EHCI_PORTSC_SUS_Msk             (_U_(0x1) << UHP_EHCI_PORTSC_SUS_Pos)          /**< (UHP_EHCI_PORTSC) Suspend (read/write) Mask */
#define UHP_EHCI_PORTSC_SUS                 UHP_EHCI_PORTSC_SUS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_SUS_Msk instead */
#define UHP_EHCI_PORTSC_PR_Pos              8                                              /**< (UHP_EHCI_PORTSC) Port Reset (read/write) Position */
#define UHP_EHCI_PORTSC_PR_Msk              (_U_(0x1) << UHP_EHCI_PORTSC_PR_Pos)           /**< (UHP_EHCI_PORTSC) Port Reset (read/write) Mask */
#define UHP_EHCI_PORTSC_PR                  UHP_EHCI_PORTSC_PR_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_PR_Msk instead */
#define UHP_EHCI_PORTSC_LS_Pos              10                                             /**< (UHP_EHCI_PORTSC) Line Status (read-only) Position */
#define UHP_EHCI_PORTSC_LS_Msk              (_U_(0x3) << UHP_EHCI_PORTSC_LS_Pos)           /**< (UHP_EHCI_PORTSC) Line Status (read-only) Mask */
#define UHP_EHCI_PORTSC_LS(value)           (UHP_EHCI_PORTSC_LS_Msk & ((value) << UHP_EHCI_PORTSC_LS_Pos))
#define UHP_EHCI_PORTSC_PP_Pos              12                                             /**< (UHP_EHCI_PORTSC) Port Power (read/write or read-only) Position */
#define UHP_EHCI_PORTSC_PP_Msk              (_U_(0x1) << UHP_EHCI_PORTSC_PP_Pos)           /**< (UHP_EHCI_PORTSC) Port Power (read/write or read-only) Mask */
#define UHP_EHCI_PORTSC_PP                  UHP_EHCI_PORTSC_PP_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_PP_Msk instead */
#define UHP_EHCI_PORTSC_PO_Pos              13                                             /**< (UHP_EHCI_PORTSC) Port Owner (read/write) Position */
#define UHP_EHCI_PORTSC_PO_Msk              (_U_(0x1) << UHP_EHCI_PORTSC_PO_Pos)           /**< (UHP_EHCI_PORTSC) Port Owner (read/write) Mask */
#define UHP_EHCI_PORTSC_PO                  UHP_EHCI_PORTSC_PO_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_PO_Msk instead */
#define UHP_EHCI_PORTSC_PIC_Pos             14                                             /**< (UHP_EHCI_PORTSC) Port Indicator Control (read/write) Position */
#define UHP_EHCI_PORTSC_PIC_Msk             (_U_(0x3) << UHP_EHCI_PORTSC_PIC_Pos)          /**< (UHP_EHCI_PORTSC) Port Indicator Control (read/write) Mask */
#define UHP_EHCI_PORTSC_PIC(value)          (UHP_EHCI_PORTSC_PIC_Msk & ((value) << UHP_EHCI_PORTSC_PIC_Pos))
#define UHP_EHCI_PORTSC_PTC_Pos             16                                             /**< (UHP_EHCI_PORTSC) Port Test Control (read/write) Position */
#define UHP_EHCI_PORTSC_PTC_Msk             (_U_(0xF) << UHP_EHCI_PORTSC_PTC_Pos)          /**< (UHP_EHCI_PORTSC) Port Test Control (read/write) Mask */
#define UHP_EHCI_PORTSC_PTC(value)          (UHP_EHCI_PORTSC_PTC_Msk & ((value) << UHP_EHCI_PORTSC_PTC_Pos))
#define UHP_EHCI_PORTSC_WKCNNT_E_Pos        20                                             /**< (UHP_EHCI_PORTSC) Wake on Connect Enable (read/write) Position */
#define UHP_EHCI_PORTSC_WKCNNT_E_Msk        (_U_(0x1) << UHP_EHCI_PORTSC_WKCNNT_E_Pos)     /**< (UHP_EHCI_PORTSC) Wake on Connect Enable (read/write) Mask */
#define UHP_EHCI_PORTSC_WKCNNT_E            UHP_EHCI_PORTSC_WKCNNT_E_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_WKCNNT_E_Msk instead */
#define UHP_EHCI_PORTSC_WKDSCNNT_E_Pos      21                                             /**< (UHP_EHCI_PORTSC) Wake on Disconnect Enable (read/write) Position */
#define UHP_EHCI_PORTSC_WKDSCNNT_E_Msk      (_U_(0x1) << UHP_EHCI_PORTSC_WKDSCNNT_E_Pos)   /**< (UHP_EHCI_PORTSC) Wake on Disconnect Enable (read/write) Mask */
#define UHP_EHCI_PORTSC_WKDSCNNT_E          UHP_EHCI_PORTSC_WKDSCNNT_E_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_WKDSCNNT_E_Msk instead */
#define UHP_EHCI_PORTSC_WKOC_E_Pos          22                                             /**< (UHP_EHCI_PORTSC) Wake on Over-current Enable (read/write) Position */
#define UHP_EHCI_PORTSC_WKOC_E_Msk          (_U_(0x1) << UHP_EHCI_PORTSC_WKOC_E_Pos)       /**< (UHP_EHCI_PORTSC) Wake on Over-current Enable (read/write) Mask */
#define UHP_EHCI_PORTSC_WKOC_E              UHP_EHCI_PORTSC_WKOC_E_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_PORTSC_WKOC_E_Msk instead */
#define UHP_EHCI_PORTSC_MASK                _U_(0x7FFDFF)                                  /**< \deprecated (UHP_EHCI_PORTSC) Register MASK  (Use UHP_EHCI_PORTSC_Msk instead)  */
#define UHP_EHCI_PORTSC_Msk                 _U_(0x7FFDFF)                                  /**< (UHP_EHCI_PORTSC) Register Mask  */


/* -------- UHP_EHCI_HSIC : (UHP_EHCI Offset: 0xb0) (R/W 32) UHP_EHCI HSIC -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t HSIC_EN:1;                 /**< bit:      1  UHP_EHCI HSIC Enable/Disable             */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UHP_EHCI_HSIC_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

