Microchip-MPLAB-Harmony/usb/apps/host/hid_basic_keyboard/firmware/src/packs/ATSAMA5D27_DFP/component/uhp_ehci.h
#define UHP_EHCI_HSIC_OFFSET                (0xB0)                                        /**<  (UHP_EHCI_HSIC) UHP_EHCI HSIC  Offset */

#define UHP_EHCI_HSIC_HSIC_EN_Pos           1                                              /**< (UHP_EHCI_HSIC) UHP_EHCI HSIC Enable/Disable Position */
#define UHP_EHCI_HSIC_HSIC_EN_Msk           (_U_(0x1) << UHP_EHCI_HSIC_HSIC_EN_Pos)        /**< (UHP_EHCI_HSIC) UHP_EHCI HSIC Enable/Disable Mask */
#define UHP_EHCI_HSIC_HSIC_EN               UHP_EHCI_HSIC_HSIC_EN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UHP_EHCI_HSIC_HSIC_EN_Msk instead */
#define UHP_EHCI_HSIC_MASK                  _U_(0x02)                                      /**< \deprecated (UHP_EHCI_HSIC) Register MASK  (Use UHP_EHCI_HSIC_Msk instead)  */
#define UHP_EHCI_HSIC_Msk                   _U_(0x02)                                      /**< (UHP_EHCI_HSIC) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief UHP_EHCI hardware registers */
typedef struct {  
  __I  uint32_t UHP_EHCI_HCCAPBASE; /**< (UHP_EHCI Offset: 0x00) UHP_EHCI Host Controller Capability Register */
  __I  uint32_t UHP_EHCI_HCSPARAMS; /**< (UHP_EHCI Offset: 0x04) UHP_EHCI Host Controller Structural Parameters Register */
  __I  uint32_t UHP_EHCI_HCCPARAMS; /**< (UHP_EHCI Offset: 0x08) UHP_EHCI Host Controller Capability Parameters Register */
  __I  uint8_t                        Reserved1[4];
  __IO uint32_t UHP_EHCI_USBCMD; /**< (UHP_EHCI Offset: 0x10) UHP_EHCI USB Command Register */
  __IO uint32_t UHP_EHCI_USBSTS; /**< (UHP_EHCI Offset: 0x14) UHP_EHCI USB Status Register */
  __IO uint32_t UHP_EHCI_USBINTR; /**< (UHP_EHCI Offset: 0x18) UHP_EHCI USB Interrupt Enable Register */
  __IO uint32_t UHP_EHCI_FRINDEX; /**< (UHP_EHCI Offset: 0x1C) UHP_EHCI USB Frame Index Register */
  __IO uint32_t UHP_EHCI_CTRLDSSEGMENT; /**< (UHP_EHCI Offset: 0x20) UHP_EHCI Control Data Structure Segment Register */
  __IO uint32_t UHP_EHCI_PERIODICLISTBASE; /**< (UHP_EHCI Offset: 0x24) UHP_EHCI Periodic Frame List Base Address Register */
  __IO uint32_t UHP_EHCI_ASYNCLISTADDR; /**< (UHP_EHCI Offset: 0x28) UHP_EHCI Asynchronous List Address Register */
  __I  uint8_t                        Reserved2[36];
  __IO uint32_t UHP_EHCI_CONFIGFLAG; /**< (UHP_EHCI Offset: 0x50) UHP_EHCI Configured Flag Register */
  __IO uint32_t UHP_EHCI_PORTSC[2]; /**< (UHP_EHCI Offset: 0x54) UHP_EHCI Port Status and Control Register */
  __I  uint8_t                        Reserved3[84];
  __IO uint32_t UHP_EHCI_HSIC;  /**< (UHP_EHCI Offset: 0xB0) UHP_EHCI HSIC */
} UhpEhci;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief UHP_EHCI hardware registers */
typedef struct {  
  __I  UHP_EHCI_HCCAPBASE_Type        UHP_EHCI_HCCAPBASE; /**< Offset: 0x00 (R/   32) UHP_EHCI Host Controller Capability Register */
  __I  UHP_EHCI_HCSPARAMS_Type        UHP_EHCI_HCSPARAMS; /**< Offset: 0x04 (R/   32) UHP_EHCI Host Controller Structural Parameters Register */
  __I  UHP_EHCI_HCCPARAMS_Type        UHP_EHCI_HCCPARAMS; /**< Offset: 0x08 (R/   32) UHP_EHCI Host Controller Capability Parameters Register */
  __I  uint8_t                        Reserved1[4];
  __IO UHP_EHCI_USBCMD_Type           UHP_EHCI_USBCMD; /**< Offset: 0x10 (R/W  32) UHP_EHCI USB Command Register */
  __IO UHP_EHCI_USBSTS_Type           UHP_EHCI_USBSTS; /**< Offset: 0x14 (R/W  32) UHP_EHCI USB Status Register */
  __IO UHP_EHCI_USBINTR_Type          UHP_EHCI_USBINTR; /**< Offset: 0x18 (R/W  32) UHP_EHCI USB Interrupt Enable Register */
  __IO UHP_EHCI_FRINDEX_Type          UHP_EHCI_FRINDEX; /**< Offset: 0x1C (R/W  32) UHP_EHCI USB Frame Index Register */
  __IO UHP_EHCI_CTRLDSSEGMENT_Type    UHP_EHCI_CTRLDSSEGMENT; /**< Offset: 0x20 (R/W  32) UHP_EHCI Control Data Structure Segment Register */
  __IO UHP_EHCI_PERIODICLISTBASE_Type UHP_EHCI_PERIODICLISTBASE; /**< Offset: 0x24 (R/W  32) UHP_EHCI Periodic Frame List Base Address Register */
  __IO UHP_EHCI_ASYNCLISTADDR_Type    UHP_EHCI_ASYNCLISTADDR; /**< Offset: 0x28 (R/W  32) UHP_EHCI Asynchronous List Address Register */
  __I  uint8_t                        Reserved2[36];
  __IO UHP_EHCI_CONFIGFLAG_Type       UHP_EHCI_CONFIGFLAG; /**< Offset: 0x50 (R/W  32) UHP_EHCI Configured Flag Register */
  __IO UHP_EHCI_PORTSC_Type           UHP_EHCI_PORTSC[2]; /**< Offset: 0x54 (R/W  32) UHP_EHCI Port Status and Control Register */
  __I  uint8_t                        Reserved3[84];
  __IO UHP_EHCI_HSIC_Type             UHP_EHCI_HSIC;  /**< Offset: 0xB0 (R/W  32) UHP_EHCI HSIC */
} UhpEhci;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of USB Host High Speed Port */

#endif /* _DA78_UHP_EHCI_COMPONENT_H_ */
